app/controllers/boards_controller.rb

    def index
      @boards = params[:tag_id].present?? Tag.find(params[:tag_id]).boards : Board.all
      @boards = @boards.page(params[:page])
---
SELECT  `boards`.* FROM `boards` LIMIT 25 OFFSET 0
SELECT COUNT(*) FROM `boards`

    def create
      board = Board.new(board_params)
      if board.save
---
INSERT INTO `boards` (`name`, `title`, `body`, `created_at`, `updated_at`) VALUES ('tamura 2', '', '', '2020-08-29 05:45:39', '2020-08-29 05:45:39')

    def update
      if @board.update(board_params)
---
UPDATE `boards` SET `title` = '練習renshu', `updated_at` = '2020-08-30 03:03:09' WHERE `boards`.`id` = 5

    def destroy
      @board.destroy
---
DELETE FROM `boards` WHERE `boards`.`id` = 1